Котельников_АБ_70153995/src/Documents/ЗаявкаНаПодбор/ЗаявкаНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПодбор</name>
  <attributes>
    <name>ПланируемыйСрокЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытияВакансии</name>
    <type>
      <types>EnumRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВакантнаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДолжности</name>
    <type>
      <types>EnumRef.КатегорииДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозиций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпытРаботы</name>
    <type>
      <types>EnumRef.ОпытРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностныеОбязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматРаботы</name>
    <type>
      <types>EnumRef.ФорматыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКЗаявке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрофессиональныеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.ПрофессиональныеНавыки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниПрофессиональныхНавыков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛичныеКачества</name>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.ЛичныеКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнанияЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.Языки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниЗнанийЯзыков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/ЗаявкаНаПодбор/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьОбязанностиУсловияТребования();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностныеОбязанностиПриИзменении(Элемент)
	Элементы.ДекорацияТекстОбязанности.Заголовок = Объект.ДолжностныеОбязанности;
КонецПроцедуры

&НаКлиенте
Процедура ТребованияПриИзменении(Элемент)
	Элементы.ДекорацияТекстТребования.Заголовок = Объект.Требования;
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриИзменении(Элемент)
	Элементы.ДекорацияТекстУсловия.Заголовок = Объект.Условия;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбязанностиУсловияТребования()

	Элементы.ДекорацияТекстОбязанности.Заголовок = Объект.ДолжностныеОбязанности;
	Элементы.ДекорацияТекстТребования.Заголовок = Объект.Требования;
	Элементы.ДекорацияТекстУсловия.Заголовок = Объект.Условия;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПрофиляДолжности(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
